**Intro to Data Visualization with Python - Task Part 1**

Import libraries

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

Import Data

In [2]:
#Create path
path = r'C:\Users\mngit\OneDrive\Data Analytics\Project Excercises\Achievement 4\Instacart Basket Analysis'

In [3]:
# import customer data set
df_customers = pd.read_csv(os.path.join(path, '02 Data','Original Data', 'customers.csv'), index_col =False)

In [4]:
# import ords_prods_merged
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))

Data quality and consistency checks - df_customers and ords_prods_merge

In [5]:
df_customers.head(5)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
#rename columns
df_customers.rename(columns = {'user_id' : 'user_id', 'First Name' : 'first_name', 'Surnam' : 'last_name', 'Gender' : 'gender', 'STATE' : 'state', 'Age':'age', 'date_joined': 'date_joined', 'n_dependants': 'no_of_dependants', 'fam_status' : 'status', 'income' : 'income'}, inplace = True)

In [7]:
df_customers.head(5)

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependants,status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
df_customers.describe()

             user_id            age  no_of_dependants         income
count  206209.000000  206209.000000     206209.000000  206209.000000
mean   103105.000000      49.501646          1.499823   94632.852548
std     59527.555167      18.480962          1.118433   42473.786988
min         1.000000      18.000000          0.000000   25903.000000
25%     51553.000000      33.000000          0.000000   59874.000000
50%    103105.000000      49.000000          1.000000   93547.000000
75%    154657.000000      66.000000          3.000000  124244.000000
max    206209.000000      81.000000          3.000000  593901.000000

In [9]:
df_customers.dtypes

user_id              int64
first_name          object
last_name           object
gender              object
state               object
age                  int64
date_joined         object
no_of_dependants     int64
status              object
income               int64
dtype: object

In [10]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   user_id           206209 non-null  int64
 1   first_name        194950 non-null  object
 2   last_name         206209 non-null  object
 3   gender            206209 non-null  object
 4   state             206209 non-null  object
 5   age               206209 non-null  int64
 6   date_joined       206209 non-null  object
 7   no_of_dependants  206209 non-null  int64
 8   status            206209 non-null  object
 9   income            206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [11]:
df_customers.shape

(206209, 10)

In [12]:
#checking for mixed types
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

first_name

In [13]:
#convert 'first_name' column’s data type from numeric to string
df_customers['first_name'] = df_customers['first_name'].astype('str')

In [14]:
#confirm no more mixed types
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

In [15]:
#check for missing values
df_customers.isnull().sum()

user_id             0
first_name          0
last_name           0
gender              0
state               0
age                 0
date_joined         0
no_of_dependants    0
status              0
income              0
dtype: int64

In [16]:
#check for duplicates
df_dups = df_customers[df_customers.duplicated()]

In [17]:
df_customers.shape

(206209, 10)

In [18]:
ords_prods_merge.shape

(32404859, 25)

In [19]:
ords_prods_merge.dtypes

order_id                            int64
user_id                             int64
eval_set                           object
order_number                        int64
orders_day_of_week                  int64
order_hour_of_day                   int64
days_since_prior_order            float64
product_id                          int64
add_to_cart_order                   int64
reordered                           int64
_merge                           category
product_name                       object
aisle_id                            int64
department_id                       int64
prices                            float64
price_range_loc                    object
busiest_day                        object
busiest_days                       object
busiest_period_of_day              object
max_order                           int64
loyalty_flag                       object
mean_prices                       float64
spending_flag                      object
median_days_since_prior_order     float64
order_frequency_flag               object
dtype: object

In [20]:
# Export df_customers to Pickle
df_customers.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'customers_wrangled.pkl'))

In [21]:
# turn 'prices' values > 100 into NaNs    *data cleaning ords_prods_merge
ords_prods_merge.loc[ords_prods_merge['prices'] >100, 'prices'] = np.nan

In [22]:
ords_prods_merge['prices'].max()

25.0

Combining Data

In [23]:
# combine ords_prods_merge and customers_wrangled
orders_products_customers = ords_prods_merge.merge(df_customers, on = 'user_id')

In [24]:
#confirm dataframes combined successfully
orders_products_customers.tail(5)

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,order_frequency_flag,first_name,last_name,gender,state,age,date_joined,no_of_dependants,status,income
32404854,156685,106143,prior,26,4,23,5.0,19675,1,1,...,Frequent customer,Gerald,Yates,Male,Hawaii,25,5/26/2017,0,single,53755
32404855,484769,66343,prior,1,6,11,7.0,47210,1,0,...,Non-frequent customer,Jacqueline,Arroyo,Female,Tennessee,22,9/12/2017,3,married,46151
32404856,1561557,66343,prior,2,1,11,30.0,47210,1,1,...,Non-frequent customer,Jacqueline,Arroyo,Female,Tennessee,22,9/12/2017,3,married,46151
32404857,276317,66343,prior,3,6,15,19.0,47210,1,1,...,Non-frequent customer,Jacqueline,Arroyo,Female,Tennessee,22,9/12/2017,3,married,46151
32404858,2922475,66343,prior,4,1,12,30.0,47210,1,1,...,Non-frequent customer,Jacqueline,Arroyo,Female,Tennessee,22,9/12/2017,3,married,46151

In [25]:
#remove unmwanted columns
orders_products_customers = orders_products_customers.drop(['eval_set'], axis='columns')

In [26]:
#confirm dataframes combined successfully
orders_products_customers.shape

(32404859, 33)

In [27]:
# Export orders_products_customers to Pickle
orders_products_customers.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers.pkl'))